# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'garethr/kubeval'
tap 'homebrew/bundle'

# Java :-(
# Needed by osquery
cask 'java'

# Tools
brew 'ag'
brew 'ansible'
brew 'bash'
brew 'binutils'
brew 'coreutils'
brew 'curl'
brew 'diffutils'
brew 'findutils', args: ['with-default-names']
brew 'gawk'
brew 'gettext', link: true
brew 'git'
brew 'gnu-indent', args: ['with-default-names']
brew 'gnu-sed'
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnutls', args: ['with-default-names']
brew 'go'
brew 'grep', args: ['with-default-names']
brew 'gzip'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'kubectl'
brew 'kubeval'
brew 'moreutils'
brew 'node'
brew 'openssl'
brew 'osquery'
brew 'pkg-config'
brew 'python'
brew 'ripgrep'
brew 'shellcheck'
brew 'stern'
brew 'stow'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'tmux-xpanes'

# Apps
cask 'docker'
cask 'minikube'
cask 'emacs'
cask 'karabiner-elements'
cask 'visual-studio-code'
cask 'virtualbox'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

