# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'garethr/kubeval'
tap 'homebrew/bundle'

# Java :-(
# Needed by osquery
#cask 'java'

# Tools
brew 'ag'
brew 'ansible'
brew 'bash'
brew 'binutils'
brew 'coreutils'
brew 'curl'
brew 'diffutils'
brew 'findutils'
brew 'gawk'
brew 'gettext', link: true
brew 'git'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'go'
brew 'grep'
brew 'gzip'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'kubectl'
brew 'kubeval'
brew 'openssl'
brew 'osquery'
brew 'pinentry-mac'
brew 'pkg-config'
brew 'python'
brew 'ripgrep'
brew 'shellcheck'
brew 'stern'
brew 'tfenv'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'tmux-xpanes'

# Apps
cask 'docker'
cask 'emacs'
cask 'karabiner-elements'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

