# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Tools
brew 'ag'
brew 'ansible'
brew 'bash'
brew 'coreutils'
brew 'curl'
brew 'findutils', args: ['with-default-names']
brew 'git'
brew 'go'
brew 'httpie'
brew 'imagick'
brew 'kubectl'
brew 'moreutils'
brew 'node'
brew 'openssl'
brew 'osquery'
brew 'pkg-config'
brew 'python'
brew 'ripgrep'
brew 'stow'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'wget'

# Apps
cask 'docker'
cask 'minikube'
cask 'emacs'
cask 'karabiner-elements'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'

